### Add and populate an ID Column to the dept_emp File

In [9]:
# Import Dependencies
import pandas as pd
import numpy as np

In [10]:
# Pull source files into dataframes

# departments.csv
source_file = "departments.csv"
departments = pd.read_csv(source_file)

#dept_empt.csv
source_file = "dept_emp.csv"
dept_emp = pd.read_csv(source_file)

# dept_manager.csv
source_file = "dept_manager.csv"
dept_manager = pd.read_csv(source_file)

# employees.csv
source_file = "employees.csv"
employees = pd.read_csv(source_file)

# salaries.csv
source_file = "salaries.csv"
salaries = pd.read_csv(source_file)

# titles.csv
source_file = "titles.csv"
titles = pd.read_csv(source_file)

In [11]:
departments.head()

   departments_id dept_no        dept_name
0             NaN    d001        Marketing
1             NaN    d002          Finance
2             NaN    d003  Human Resources
3             NaN    d004       Production
4             NaN    d005      Development

# Populate the ID columns

In [12]:
# departments
IDs = []
total = len(departments)
IDs = np.arange(1, total+1, 1).tolist()
IDs
departments['departments_id'] = IDs
departments.head()

   departments_id dept_no        dept_name
0               1    d001        Marketing
1               2    d002          Finance
2               3    d003  Human Resources
3               4    d004       Production
4               5    d005      Development

In [13]:
# dept_emp
IDs = []
total = len(dept_emp)
IDs = np.arange(1, total+1, 1).tolist()
IDs
dept_emp['dept_emp_id'] = IDs
dept_emp.head()

   dept_emp_id  emp_no dept_no  from_date   to_date
0            1   10001    d005  6/26/1986  1/1/9999
1            2   10002    d007   8/3/1996  1/1/9999
2            3   10003    d004  12/3/1995  1/1/9999
3            4   10004    d004  12/1/1986  1/1/9999
4            5   10005    d003  9/12/1989  1/1/9999

In [14]:
# dept_manager
IDs = []
total = len(dept_manager)
IDs = np.arange(1, total+1, 1).tolist()
IDs
dept_manager['dept_manager_id'] = IDs
dept_manager.head()

   dept_manager_id dept_no  emp_no   from_date     to_date
0                1    d001  110022    1/1/1985   10/1/1991
1                2    d001  110039   10/1/1991    1/1/9999
2                3    d002  110085    1/1/1985  12/17/1989
3                4    d002  110114  12/17/1989    1/1/9999
4                5    d003  110183    1/1/1985   3/21/1992

In [15]:
# employees
IDs = []
total = len(employees)
IDs = np.arange(1, total+1, 1).tolist()
IDs
employees['employees_id'] = IDs
employees.head()

   employees_id  emp_no birth_date first_name last_name gender   hire_date
0             1   10001   9/2/1953     Georgi   Facello      M   6/26/1986
1             2   10002   6/2/1964    Bezalel    Simmel      F  11/21/1985
2             3   10003  12/3/1959      Parto   Bamford      M   8/28/1986
3             4   10004   5/1/1954  Chirstian   Koblick      M   12/1/1986
4             5   10005  1/21/1955    Kyoichi  Maliniak      M   9/12/1989

In [16]:
# salaries
IDs = []
total = len(salaries)
IDs = np.arange(1, total+1, 1).tolist()
IDs
salaries['salaries_id'] = IDs
salaries.head()

   salaries_id  emp_no  salary  from_date    to_date
0            1   10001   60117  6/26/1986  6/26/1987
1            2   10002   65828   8/3/1996   8/3/1997
2            3   10003   40006  12/3/1995  12/2/1996
3            4   10004   40054  12/1/1986  12/1/1987
4            5   10005   78228  9/12/1989  9/12/1990

In [17]:
# titles
IDs = []
total = len(titles)
IDs = np.arange(1, total+1, 1).tolist()
IDs
titles['titles_id'] = IDs
titles.head()

   titles_id  emp_no            title  from_date    to_date
0          1   10001  Senior Engineer  6/26/1986   1/1/9999
1          2   10002            Staff   8/3/1996   1/1/9999
2          3   10003  Senior Engineer  12/3/1995   1/1/9999
3          4   10004         Engineer  12/1/1986  12/1/1995
4          5   10004  Senior Engineer  12/1/1995   1/1/9999

# Export the results to CSV

In [18]:
# departments
departments.to_csv('departments.csv')
print("Export complete")

Export complete

In [19]:
# dept_emp
dept_emp.to_csv('dept_emp.csv')
print("Export complete")

Export complete

In [20]:
# dept_manager
dept_manager.to_csv('dept_manager.csv')
print("Export complete")

Export complete

In [21]:
# employees
employees.to_csv('employees.csv')
print("Export complete")

Export complete

In [22]:
# salaries
salaries.to_csv('salaries.csv')
print("Export complete")

Export complete

In [23]:
# titles
titles.to_csv('titles.csv')
print("Export complete")

Export complete